app/controllers/articles_controller.rb

	def index
		##Nos permite traer todos los
		##registros que estan en la
		##tabla articles
		@articles=Article.all
---
SELECT "articles".* FROM "articles"

	def create

		##Primer forma sin usar strong params
		##@article=Article.new(
		##	title: params[:article][:title],
 		##	body: params[:article][:body])

		##Usando strong params

		@article=current_user.articles.new(article_params)
		@article.categories=params[:categories]
		if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Tercero"], ["body", "Iron Man"], ["created_at", "2016-01-01 04:12:44.784111"], ["updated_at", "2016-01-01 04:12:44.784111"]]

	def update
		#@article.update_attributes({title: 'Nuevo titulo'})
		if @article.update(article_params)
---
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "Nueva cosa que wscribimos para actualzar"], ["updated_at", "2016-01-05 19:52:58.539160"], ["id", 1]]

	def destroy
		@article.destroy ##Elimina el objeto de la db
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]